{
  "backend/main.mo": "Motoko actor defining BookingSubmission type and storing demo class bookings in a Map with a query function to retrieve all submissions.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: admin dashboard page creation, backend connection with React Query, and header navigation link addition.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, and configuration for the Takshashila Academia educational website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color system for the application.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Takshashila Academia application.",
  "frontend/src/App.tsx": "TanStack Router setup defining root layout with Header/Footer, home page route with all landing sections, and /admin route for AdminDashboard.",
  "frontend/src/components/About.tsx": "About section component displaying Takshashila Academia's mission statement and six educational highlights with icons in a responsive grid.",
  "frontend/src/components/Contact.tsx": "Contact section displaying phone numbers with role labels, email, physical address in Pune, and business hours in card format with call-to-action buttons.",
  "frontend/src/components/Courses.tsx": "Courses section showcasing five main categories (UPSC, MPSC, NEET, JEE, Skill Development) with detailed subject breakdowns and icons for competitive exam preparation.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Takshashila Academia branding, quick navigation links, contact information (phone numbers, email, address), and copyright notice with a Made with Love attribution.",
  "frontend/src/components/Header.tsx": "Sticky header component with logo, desktop/mobile navigation menus, and smooth scrolling functionality to page sections; includes mobile hamburger menu toggle and admin link.",
  "frontend/src/components/Hero.tsx": "Hero section featuring Takshashila Academia's main headline, tagline with motivational quote, CTA buttons for enrollment and course exploration, and statistics cards showing student count, success rate, and experience.",
  "frontend/src/components/Introduction.tsx": "Introduction section displaying four value proposition cards (Excellence, Personalized Learning, Passionate Teaching, Holistic Development) explaining why to choose Takshashila Academia.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section showing six student and parent reviews in a grid layout, each with 5-star ratings, quotes, and reviewer details.",
  "frontend/src/components/YouTubeGallery.tsx": "Empty component file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hook that fetches all demo class booking submissions from the backend actor using TanStack Query.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm educational color palette (terracotta, sage, amber) for light and dark modes, plus custom fonts (Inter, Merriweather).",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying demo class booking requests in a table with stats cards showing total bookings, participants, and latest request using data from useGetAllSubmissions hook.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors using OKLCH color space, custom fonts (Inter, Merriweather), animations, and plugins for typography and container queries.",
  "project_state.json": "Project state tracking document showing an educational institute website with completed admin dashboard features and pending requests for demo class booking form and updated student reviews."
}